{
  "en": {
    "about": "About Me",
    "experience": "Experience",
    "portfolio": "My Work",
    "portfolio-button": "View My Work",
    "contact": "Contact",
    "contact-button": "Get in Touch",
    "about-heading": "About Me",
    "hero-heading": "Frontend Software Developer",
    "about-text-1": "As a software developer with almost 2 years of experience, I have a solid foundation in building responsive websites and web applications. My specialty is in VueJs, where I have 9 months of immersive experience, but I am also proficient in JavaScript, ReactJs, TypeScript, SASS, HTML5, and CSS3. I have experience with component development following Design System Patterns, flow and screen development according to Design specifications using Figma, and applying the Style Guide for VueJs and the B.E.M. methodology. I have used libraries such as Element Plus, Phosphor Icons, Ion Icons, Tailwind CSS, Material Icons, and Bootstrap.",
    "about-text-2": "My experience collaborating with Frontend and Backend, Java, Ruby, Quality Assurance, Design (UI/UX), and Integration teams has given me an overview of the entire development process, where I can learn and contribute at each stage. I have experience working with Git, Github, and Bitbucket, and project management based on agile methodologies and using tools like Slack and JIRA.",
    "about-text-3": "Prior to my career in software development, I worked in Business Management, where I helped people improve their skills and companies achieve their goals. In 2011, I started a retail franchise Business where I coordinated financial and administrative areas, managing 3 stores. My background as a Manager and Consultant has taught me the importance of solid Strategic Planning, which is key to inspiring people with an authentic sense of belonging to organizations and delivering a genuine customer experience that transforms the performance of the company and the product.",
    "about-text-4": "In 2021, I made my career transition to the world of programming, which started as a curiosity and turned into an extraordinary and fascinating universe that I am passionate about. As a developer, my goal is to deliver scalable, high-quality products with an excellent user experience that impacts the lives of thousands of people. I am a team player and enjoy working collaboratively, contributing my expertise to the team. I am excited to collaborate with professionals who value excellence, innovation, and teamwork.",
    "skill-text-agile": "Agile Methodologies - SCRUM",
    "skill-text-planning": "Strategic Planning",
    "skill-text-scenarios": "Analysis of Scenarios and Decision Making",
    "skill-text-organization": "Organization",
    "skill-text-communication": "Communication",
    "skill-text-management": "Management",
    "skill-text-leadership": "Ladership",
    "skill-text-teamwork": "Teamwork",
    "experience-heading": "Experience",
    "careers-heading": "Careers",
    "experience-date-1": "Oct 2021 - Present",
    "experience-text-1a": "Freelance Frontend Developer, building fully responsive websites and web applications:",
    "experience-text-1b": "- I built two Food Apps as final projects for HTML&CSS and VueJs courses.",
    "experience-text-1c": "- I developed Portfolio Landing Pages, a Music Player, a couple of Games, a Habit Tracker and a Pokedex. I work with the frameworks VueJs and ReactJs, libraries such as Element Plus, Phosphor Icons and Tailwind CSS, and Backend structures and Databases like NodeJs and Prisma ORM.",
    "experience-location-1": "Remote, Brazil",
    "experience-heading-2": "Frontend Developer",
    "experience-date-2": "Aug 2022 - Mar 2023",
    "experience-text-2a": "Worked with the frontend team on the most recent additions and releases of Cilia's products and services, as well as collaborating with the Java, Ruby, QA, Design (UI/UX) and Integration teams:",
    "experience-text-2b": "- Maintaining and improving legacy code and applying new features to Cilia's main products.",
    "experience-text-2c": "- Creation and implementation of several components for the new version of one of the company's products, built entirely with VueJs, using TypeScript, SASS, Bootstrap and libraries such as Element Plus and Material Icons.",
    "experience-text-2d": "- Between September 2022 and March 2023, I maintained, improved, and added new features to Cilia's legacy code, while also refactoring the frontend with VueJs. This involved learning TypeScript and SASS and componentizing the system in VueJs to improve component creation and align the application with business rules.",
    "experience-location-2": "Goiânia-GO, Brazil |",
    "experience-heading-3": "Franchise Owner",
    "experience-date-3": "Jul 2018 - Oct 2022",
    "experience-text-3": "Coordination of Administrative and Financial areas, H.R., inventory control, accounting documents control, analysis and decision making.",
    "experience-heading-4": "Associate Consultant",
    "experience-date-4": "Nov 2008 - Aug 2022",
    "experience-text-4": "Focused on Strategic Planning, Analysis of Scenarios, Decision Making, Management and Leadership Skills, Development and Application of Processes, Development and Management of Teams.",
    "experience-location-4": "Brazil |",
    "experience-date-5": "Sep 2011 - Sep 2021",
    "experience-heading-6": "Financial and Administrative Manager",
    "experience-date-6": "Mar 2017 - Feb 2020",
    "experience-text-6": "Management of the Administrative and Financial areas.",
    "experience-heading-7": "Internship",
    "experience-date-7": "Oct 2003 - Feb 2007",
    "experience-text-7": "Junior analyst at Tegra Incorporadora (Former MB Engenharia), at Administrative and Financial Departments.",
    "education-heading": "Education",
    "education-date-1": "Mar 2023 - Present",
    "education-location-1": "Remote, Brazil |",
    "education-date-2": "Jan 2023 - Present",
    "education-date-3": "Dec 2021 - Dec 2022",
    "education-date-4": "Aug 2022",
    "education-date-5": "Feb 2022 - Aug 2022",
    "education-date-6": "Sep 2021 - Nov 2021",
    "education-text-6": "Course - Build Responsive Real World Websites with HTML and CSS",
    "education-date-7": "Sep 2021 - Oct 2021",
    "education-text-7": "Discover Course - The programming fundamentals. HTML and CSS guides",
    "education-text-8": "Course - Call to Action: Christian Ethics applied to marketing and communication",
    "education-heading-9": "Salgado de Oliveira University",
    "education-date-9": "Jan 2003 - Dec 2008",
    "education-text-9": "Bachelor in Business Administration",
    "portfolio-heading": "My Work",
    "portfolio-text": "Here are some of my most recent projects.",
    "contact-heading": "Contact",
    "contact-location": "Goiânia-GO | Brazil"
  },
  "pt": {
    "about": "Sobre",
    "experience": "Experiência",
    "portfolio": "Meu Trabalho",
    "portfolio-button": "Meu Trabalho",
    "contact": "Contato",
    "contact-button": "Meus Contatos",
    "about-heading": "Sobre Mim",
    "hero-heading": "Desenvolvedor de Softwares Frontend",
    "about-text-1": "Como desenvolvedor de softwares com quase 2 anos de experiência, tenho uma base sólida na construção de sites e aplicativos web responsivos. Minha especialidade é em VueJs, com 9 meses de experiência imersiva, mas também sou proficiente em JavaScript, ReactJs, TypeScript, SASS, HTML5 e CSS3. Tenho experiência com desenvolvimento de componentes seguindo Design System Patterns, desenvolvimento de fluxos e telas de acordo com especificações de Design usando Figma, e aplicando o Guia de Estilos para VueJs e a metodologia B.E.M.. Tenho usado bibliotecas como Element Plus, Phosphor Icons, Ion Icons, Tailwind CSS, Material Icons e Bootstrap.",
    "about-text-2": "Minha experiência colaborando com equipes de Frontend e Backend, Java, Ruby, Quality Assurance, Design (UI/UX) e Integração me deu uma visão geral de todo o processo de desenvolvimento, onde posso aprender e contribuir em cada etapa. Tenho experiência trabalhando com Git, Github e Bitbucket, e gerenciamento de projetos baseado em metodologias ágeis e utilizando ferramentas como Slack e JIRA.",
    "about-text-3": "Antes da minha carreira em desenvolvimento de softwares, trabalhei em Gestão de Negócios, onde ajudei pessoas a melhorar suas habilidades e empresas a atingirem seus objetivos. Em 2011, iniciei um negócio de franquia de varejo onde coordenei as áreas financeira e administrativa, gerenciando 3 lojas. Minha formação como Gestor e Consultor me ensinou a importância de um Planejamento Estratégico sólido, fundamental para inspirar nas pessoas um autêntico senso de pertencimento às organizações e entregar uma experiência genuína ao cliente que transforma o desempenho da empresa e do produto.",
    "about-text-4": "Em 2021, fiz minha transição de carreira para o mundo da programação, que começou como uma curiosidade e se transformou em um universo extraordinário e fascinante pelo qual sou apaixonado. Como desenvolvedor, meu objetivo é entregar produtos escaláveis e de alta qualidade com uma excelente experiência do usuário que impacte a vida de milhares de pessoas. Sou um team player e gosto de trabalhar de forma colaborativa, contribuindo com minha experiência para a equipe. Fico contente em colaborar com profissionais que valorizam a excelência, inovação e trabalho em equipe.",
    "skill-text-agile": "Metodologias Ágeis - SCRUM",
    "skill-text-planning": "Planejamento Estratégico",
    "skill-text-scenarios": "Análise de Cenários e Tomada de Decisões",
    "skill-text-organization": "Organização",
    "skill-text-communication": "Comunicação",
    "skill-text-management": "Gestão",
    "skill-text-leadership": "Liderança",
    "skill-text-teamwork": "Trabalho em Equipe",
    "experience-heading": "Experiência",
    "careers-heading": "Carreira",
    "experience-date-1": "Out 2021 - Presente",
    "experience-text-1a": "Desenvolvedor Frontend Freelancer, construindo sites e aplicações web totalmente responsivos:",
    "experience-text-1b": "- Desenvolvi dois Food Apps como projetos de conclusão de Curso de HTML&CSS e de VueJs.",
    "experience-text-1c": "- Desenvolvi projetos de Landing Pages de Portfolio, um Player de Música, alguns Games e um Rastreador de Hábitos. Trabalho com os frameworks VueJs e ReactJs, bibliotecas como Element Plus, Phosphor Icons e Tailwind CSS, e estruturas de Backend e Databases como NodeJs e Prisma ORM.",
    "experience-location-1": "Remoto, Brasil",
    "experience-heading-2": "Desenvolvedor Frontend",
    "experience-date-2": "Ago 2022 - Mar 2023",
    "experience-text-2a": "Trabalhei com a equipe de frontend nas mais recentes features e releases de produtos e serviços da Cilia, além de colaborar com as equipes de Java, Ruby, QA, Design (UI/UX) e Integração:",
    "experience-text-2b": "- Manutenção e melhoria do código legado e aplicação de novas funcionalidades aos principais produtos da Cilia.",
    "experience-text-2c": "- Criação e implementação de diversos componentes para a nova versão de um dos produtos da empresa, construída inteiramente em VueJs, utilizando TypeScript, SASS, Bootstrap e bibliotecas como Element Plus e Material Icons.",
    "experience-text-2d": "- Entre setembro de 2022 e março de 2023, mantive, melhorei e adicionei novos recursos ao código legado da Cilia, além de refatorar o frontend com VueJs. Isso envolveu aprender TypeScript e SASS e componentizar o sistema em VueJs para melhorar a criação de componentes e alinhar a aplicação com as regras de negócios.",
    "experience-location-2": "Goiânia-GO, Brasil |",
    "experience-heading-3": "Franqueado",
    "experience-date-3": "Jul 2018 - Out 2022",
    "experience-text-3": "Coordenação das áreas Administrativa e Financeira, RH, controle de estoque, controle de documentos contábeis, análise e tomada de decisões.",
    "experience-heading-4": "Consultor Associado",
    "experience-date-4": "Nov 2008 - Ago 2022",
    "experience-text-4": "Focado em Planejamento Estratégico, Análise de Cenários, Tomada de Decisões, Gestão e Liderança, Desenvolvimento e Aplicação de Processos, Desenvolvimento e Gestão de Equipes.",
    "experience-location-4": "Brasil |",
    "experience-date-5": "Set 2011 - Set 2021",
    "experience-heading-6": "Gestor Administrativo e Financeiro",
    "experience-date-6": "Mar 2017 - Fev 2020",
    "experience-text-6": "Gestão das áreas Administrativa e Financeira.",
    "experience-heading-7": "Estágio",
    "experience-date-7": "Out 2003 - Fev 2007",
    "experience-text-7": "Analista júnior na Tegra Incorporadora (ex-MB Engenharia), nas áreas Administrativa e Financeira.",
    "education-heading": "Formação",
    "education-date-1": "Out 2022 - Presente",
    "education-location-1": "Remoto, Brasil |",
    "education-date-2": "Jan 2023 - Presente",
    "education-date-3": "Dez 2021 - Dez 2022",
    "education-date-4": "Ago 2022",
    "education-date-5": "Fev 2022 - Ago 2022",
    "education-date-6": "Set 2021 - Nov 2021",
    "education-text-6": "Curso - Build Responsive Real World Websites with HTML and CSS",
    "education-date-7": "Set 2021 - Out 2021",
    "education-text-7": "Curso Discover — Fundamentos da programação. Guias de HTML e CSS",
    "education-text-8": "Curso - Call to Action: Ética Cristã aplicada ao marketing e à comunicação",
    "education-heading-9": "Universidade Salgado de Oliveira",
    "education-date-9": "Jan 2003 - Dez 2008",
    "education-text-9": "Bacharelado em Administração de Empresas",
    "portfolio-heading": "Meu Trabalho",
    "portfolio-text": "Aqui estão alguns dos meus projetos mais recentes.",
    "contact-heading": "Contato",
    "contact-location": "Goiânia-GO | Brasil"
  }
}
