{
  "en": {
    "about": "About Me",
    "experience": "Experience",
    "portfolio": "My Work",
    "portfolio-button": "View My Work",
    "contact": "Contact",
    "contact-button": "Get in Touch",
    "about-heading": "About Me",
    "hero-heading": "Software Developer",
    "about-text-1": "Software engineer specialized in building responsive and optimized web applications. I have delivered high-quality software solutions, with a primary focus on VueJs and ReactJs, ensuring substantial business growth for multiple clients.",
    "about-text-2": "My experience collaborating with great Designer and Developer teams has given me an overview of the entire development process, where I can learn and contribute at each stage. I am confident in my ability to develop and maintain platforms and web apps. I am a team player and like to work contributing my expertise to the team. My goal is to develop scalable, high-quality software solutions and to collaborate with professionals who value excellence, innovation and teamwork.",
    "about-text-3": "Prior to my career in software development, I worked in Business Management, where I helped people improve their skills and companies achieve their goals. In 2011, I started a retail franchise Business where I coordinated financial and administrative areas, managing 3 stores. My background as a Manager and Consultant has taught me the importance of solid Strategic Planning, which is key to inspiring people with an authentic sense of belonging to organizations and delivering a genuine customer experience that transforms the performance of the company and the product.",
    "about-text-4": "In 2021, I made my career transition and realized that I had found something I am truly passionate about. The possibility of creating something new, facing challenges, learning and evolving, is what drives me as a software developer.",
    "skill-text-agile": "Agile Methodologies - SCRUM",
    "skill-text-planning": "Strategic Planning",
    "skill-text-scenarios": "Analysis of Scenarios",
    "skill-text-organization": "Organization",
    "skill-text-communication": "Communication",
    "skill-text-management": "Management",
    "skill-text-leadership": "Ladership",
    "skill-text-teamwork": "Teamwork",
    "skill-text-decision": "Decision Making",
    "experience-heading": "Experience",
    "careers-heading": "Careers",
    "experience-date-1": "Oct 2021 - Present",
    "experience-text-1a": "Building responsive and optimized web apps. Delivering high-quality software solutions:",
    "experience-text-1b": "- Ensured a 9.9% increase in Instagram followers in the last 90 days by enhancing a Linktree Page for a client and enabled an increase of 49% in the last 60 days, in accounts with engagement, by optimizing the client's Linktree Page.",
    "experience-text-1c": "- Integrated GitHub’s API on a ReactJs project called GitHub User Finder.",
    "experience-text-1d": "- Developed 2 Food Apps fully responsive and ready for implementation.",
    "experience-location-1": "Remote, Brazil |",
    "experience-heading-2": "Software Engineer",
    "experience-date-2": "Aug 2022 - Mar 2023",
    "experience-text-2a": "- Optimized and delivered within 6 months a Minimum Viable Product (MVP) to production, collaborating with frontend and backend teams.",
    "experience-text-2b": "- Integrated API and endpoints with frontend components, implemented functionalities, and created services for the MVP.",
    "experience-text-2c": "- Facilitated understanding and enabled effective component testing by producing comprehensive documentation.",
    "experience-text-2d": "- Improved tasks delivery time by 15% and enhanced legacy code, through collaboration with the maintenance team.",
    "experience-location-2": "Goiânia-GO, Brazil |",
    "experience-heading-3": "Franchise Owner",
    "experience-date-3": "Jul 2018 - Oct 2022",
    "experience-text-3": "Coordination of Administrative and Financial areas, H.R., inventory control, accounting documents control, analysis and decision making.",
    "experience-heading-4": "Associate Consultant",
    "experience-date-4": "Nov 2008 - Aug 2022",
    "experience-text-4": "Focused on Strategic Planning, Analysis of Scenarios, Decision Making, Management and Leadership Skills, Development and Application of Processes, Development and Management of Teams.",
    "experience-location-4": "Brazil |",
    "experience-date-5": "Sep 2011 - Sep 2021",
    "experience-heading-6": "Financial and Administrative Manager",
    "experience-date-6": "Mar 2017 - Feb 2020",
    "experience-text-6": "Management of the Administrative and Financial areas.",
    "experience-heading-7": "Internship",
    "experience-date-7": "Oct 2003 - Feb 2007",
    "experience-text-7": "Junior analyst at Tegra Incorporadora (Former MB Engenharia), at Administrative and Financial Departments.",
    "education-heading": "Education",
    "education-date-1": "Mar 2023 - Present",
    "education-location-1": "Remote, Brazil |",
    "education-date-2": "Jan 2023 - Present",
    "education-date-3": "Dec 2021 - Dec 2022",
    "education-date-4": "Aug 2022",
    "education-date-5": "Feb 2022 - Aug 2022",
    "education-date-6": "Sep 2021 - Nov 2021",
    "education-text-6": "Course - Build Responsive Real World Websites with HTML and CSS",
    "education-date-7": "Sep 2021 - Oct 2021",
    "education-text-7": "Discover Course - The programming fundamentals. HTML and CSS guides",
    "education-text-8": "Course - Call to Action: Christian Ethics applied to marketing and communication",
    "education-heading-9": "Salgado de Oliveira University",
    "education-date-9": "Jan 2003 - Dec 2008",
    "education-text-9": "Bachelor in Business Administration",
    "portfolio-heading": "My Work",
    "portfolio-text": "Here are some of my most recent projects.",
    "contact-heading": "Contact",
    "contact-location": "Goiânia-GO | Brazil"
  },
  "pt": {
    "about": "Sobre",
    "experience": "Experiência",
    "portfolio": "Meu Trabalho",
    "portfolio-button": "Meu Trabalho",
    "contact": "Contato",
    "contact-button": "Meus Contatos",
    "about-heading": "Sobre Mim",
    "hero-heading": "Desenvolvedor de Softwares",
    "about-text-1": "Engenheiro de software especializado na construção de aplicações web responsivas e otimizadas. Entreguei soluções de software de alta qualidade, com foco principal em VueJs e ReactJs, garantindo um crescimento substancial dos negócios para vários clientes.",
    "about-text-2": "Minha experiência colaborando com grandes equipes de Designer e Desenvolvedor me deu uma visão geral de todo o processo de desenvolvimento, onde posso aprender e contribuir em cada etapa. Estou confiante em minha capacidade de desenvolver e manter plataformas e aplicativos da web. Sou um jogador de equipe e gosto de trabalhar contribuindo com meus conhecimentos para a equipe. Meu objetivo é desenvolver soluções de software escaláveis e de alta qualidade e colaborar com profissionais que valorizam excelência, inovação e trabalho em equipe.",
    "about-text-3": "Antes da minha carreira em desenvolvimento de softwares, trabalhei em Gestão de Negócios, onde ajudei pessoas a melhorar suas habilidades e empresas a atingirem seus objetivos. Em 2011, iniciei um negócio de franquia de varejo onde coordenei as áreas financeira e administrativa, gerenciando 3 lojas. Minha formação como Gestor e Consultor me ensinou a importância de um Planejamento Estratégico sólido, fundamental para inspirar nas pessoas um autêntico senso de pertencimento às organizações e entregar uma experiência genuína ao cliente que transforma o desempenho da empresa e do produto.",
    "about-text-4": "Em 2021, fiz minha transição de carreira e percebi que havia encontrado algo pelo qual sou verdadeiramente apaixonado. A possibilidade de criar algo novo, enfrentar desafios, aprender e evoluir, é o que me move como desenvolvedor de software.",
    "skill-text-agile": "Metodologias Ágeis - SCRUM",
    "skill-text-planning": "Planejamento Estratégico",
    "skill-text-scenarios": "Análise de Cenários",
    "skill-text-organization": "Organização",
    "skill-text-communication": "Comunicação",
    "skill-text-management": "Gestão",
    "skill-text-leadership": "Liderança",
    "skill-text-teamwork": "Trabalho em Equipe",
    "skill-text-decision": "Tomada de Decisões",
    "experience-heading": "Experiência",
    "careers-heading": "Carreira",
    "experience-date-1": "Out 2021 - Presente",
    "experience-text-1a": "Criação de aplicativos da Web responsivos e otimizados. Fornecendo soluções de software de alta qualidade:",
    "experience-text-1b": "- Assegurei um aumento de 9,9% de seguidores no Instagram nos últimos 90 dias ao aprimorar uma Linktree Page para uma cliente e viabilizei um aumento de 49% nos últimos 60 dias, em contas com engajamento, otimizando a Linktree Page da cliente.",
    "experience-text-1c": "- Integrei a API do GitHub em um projeto ReactJs chamado GitHub User Finder.",
    "experience-text-1d": "- Desenvolvi 2 Food Apps totalmente responsivos e prontos para implementação.",
    "experience-location-1": "Remoto, Brasil |",
    "experience-heading-2": "Software Engineer",
    "experience-date-2": "Ago 2022 - Mar 2023",
    "experience-text-2a": "- Otimizei e entreguei em 6 meses um MVP para produção, colaborando com as equipes de frontend e backend.",
    "experience-text-2b": "- Integrei API e endpoints com componentes de frontend, implementei funcionalidades e criei serviços para o MVP.",
    "experience-text-2c": "- Facilitei a compreensão e possibilitei testes de componentes eficazes por meio da produção de documentação abrangente.",
    "experience-text-2d": "- Melhorei o tempo de entrega de tarefas em 15% e aprimorei código legado, através da colaboração com a equipe de manutenção.",
    "experience-location-2": "Goiânia-GO, Brasil |",
    "experience-heading-3": "Franqueado",
    "experience-date-3": "Jul 2018 - Out 2022",
    "experience-text-3": "Coordenação das áreas Administrativa e Financeira, RH, controle de estoque, controle de documentos contábeis, análise e tomada de decisões.",
    "experience-heading-4": "Consultor Associado",
    "experience-date-4": "Nov 2008 - Ago 2022",
    "experience-text-4": "Focado em Planejamento Estratégico, Análise de Cenários, Tomada de Decisões, Gestão e Liderança, Desenvolvimento e Aplicação de Processos, Desenvolvimento e Gestão de Equipes.",
    "experience-location-4": "Brasil |",
    "experience-date-5": "Set 2011 - Set 2021",
    "experience-heading-6": "Gestor Administrativo e Financeiro",
    "experience-date-6": "Mar 2017 - Fev 2020",
    "experience-text-6": "Gestão das áreas Administrativa e Financeira.",
    "experience-heading-7": "Estágio",
    "experience-date-7": "Out 2003 - Fev 2007",
    "experience-text-7": "Analista júnior na Tegra Incorporadora (ex-MB Engenharia), nas áreas Administrativa e Financeira.",
    "education-heading": "Formação",
    "education-date-1": "Out 2022 - Presente",
    "education-location-1": "Remoto, Brasil |",
    "education-date-2": "Jan 2023 - Presente",
    "education-date-3": "Dez 2021 - Dez 2022",
    "education-date-4": "Ago 2022",
    "education-date-5": "Fev 2022 - Ago 2022",
    "education-date-6": "Set 2021 - Nov 2021",
    "education-text-6": "Curso - Build Responsive Real World Websites with HTML and CSS",
    "education-date-7": "Set 2021 - Out 2021",
    "education-text-7": "Curso Discover — Fundamentos da programação. Guias de HTML e CSS",
    "education-text-8": "Curso - Call to Action: Ética Cristã aplicada ao marketing e à comunicação",
    "education-heading-9": "Universidade Salgado de Oliveira",
    "education-date-9": "Jan 2003 - Dez 2008",
    "education-text-9": "Bacharelado em Administração de Empresas",
    "portfolio-heading": "Meu Trabalho",
    "portfolio-text": "Aqui estão alguns dos meus projetos mais recentes.",
    "contact-heading": "Contato",
    "contact-location": "Goiânia-GO | Brasil"
  }
}
